export const benefits = [
  {
    id: 1,
    icon: "⏱️",
    title:
      "Гнучкий графік занять. Ми дбаємо про ваш комфорт, тому підберемо для вас найзручніший час",
  },
  {
    id: 2,
    icon: "👥",
    title: "Індивідуальне навчання, або в міні групі до 7 людей",
  },
  {
    id: 3,
    icon: "💰",
    title: "Доступна ціна, бонуси і знижки для сімей військових",
  },
  {
    id: 4,
    icon: "📲",
    title:
      "Сучасний підхід до вивчення мови, курс сучасно адаптований та збагачений інтерактивом",
  },
  {
    id: 5,
    icon: "🇩🇪",
    title:
      "Занурення в іншомовне середовище. Поступово нарощуємо відсоток навчання іноземною, а після плавного впровадження - навчання буде повністю німецькою!",
  },
  {
    id: 6,
    icon: "📖",
    title:
      "Ви завжди зможете отримати зворотній зв*язок та отримати допомогу від викладача з домашніми завданнями",
  },
];
