export const faqItems = [
  {
    title: "Як попасти на пробне заняття?",
    content: "Заповнити форму на сайті, або написати нам у месенджери",
  },

  {
    title: "Яка вартість пробного?",
    content:
      "Ми проводимо пробні за донат на ЗСУ. Ви самі обираєте перевірене джерело, та суму, яку ви хочете внести в благодійний фонд. Як альтернатива: Ви можете скласти за донат-алфавітом своє місто та отриману суму відправити на допомогу 😊",
  },
  {
    title: "Де проходять уроки?",
    content:
      "Уроки проходять повністю онлайн, на платформах Google Meet, Zoom, Discord у залежності від групи",
  },

  {
    title: "Скільки дітей у групі?",
    content:
      "Групи до 6 людей. Ми стараємось робити групи меншими, задля більшої ефективності ",
  },
  {
    title: " Яка вартість навчання?",
    content:
      "Оплата за навчання вноситься тільки абонементом, сумою  2000 в місяць за один напрямок.",
  },
  {
    title: "Чи є навчання для дорослих?",
    content:
      "Так, є) Переважно, ми працюємо з дітьми, але так само з нами вчаться й багато дорослих) Вік від 6 років і далі без обмежень)",
  },
];
